<a href="https://colab.research.google.com/github/yinglinglow/GA_projects/blob/master/day3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Lists

Create a list of tickers in the order of: AAPL, ADBE, IBM.

Print the first ticker in the list.

Print the length of the list.

In [12]:
tickers = ["AAPL", "ADBE", "IBM"]
print(tickers[0])
print(len(tickers))

AAPL
3

Add a new ticker ORCL to the end of the list

In [13]:
tickers.append('ORCL')
tickers

['AAPL', 'ADBE', 'IBM', 'ORCL']

Create another list called additional_tickers, with GOOG and NFLX.
Add the lists together to form a new list called full_tickers

In [14]:
additional_tickers = ['GOOG', 'NFLX']
full_tickers = tickers + additional_tickers
full_tickers

['AAPL', 'ADBE', 'IBM', 'ORCL', 'GOOG', 'NFLX']

## For Loops

For each ticker in the list full_tickers, generate and print a csv filename given a filepath (C:/Users/Documents)

i.e. C:/Users/Documents/AAPL.csv

In [15]:
for ticker in full_tickers:
  print(f'C:/Users/Documents/{ticker}.csv')

C:/Users/Documents/AAPL.csv
C:/Users/Documents/ADBE.csv
C:/Users/Documents/IBM.csv
C:/Users/Documents/ORCL.csv
C:/Users/Documents/GOOG.csv
C:/Users/Documents/NFLX.csv

Save the filenames to a new list called full_filepaths

In [22]:
full_filepaths = []

for ticker in full_tickers:
  full_filepaths.append(f'C:/Users/Documents/{ticker}.csv')

full_filepaths

['C:/Users/Documents/AAPL.csv',
 'C:/Users/Documents/ADBE.csv',
 'C:/Users/Documents/IBM.csv',
 'C:/Users/Documents/ORCL.csv',
 'C:/Users/Documents/GOOG.csv',
 'C:/Users/Documents/NFLX.csv']

What is another way to do it?

In [23]:
full_filepaths = [f'C:/Users/Documents/{ticker}.csv' for ticker in full_tickers]
full_filepaths

['C:/Users/Documents/AAPL.csv',
 'C:/Users/Documents/ADBE.csv',
 'C:/Users/Documents/IBM.csv',
 'C:/Users/Documents/ORCL.csv',
 'C:/Users/Documents/GOOG.csv',
 'C:/Users/Documents/NFLX.csv']

## Additional

For each ticker in the list full_tickers, print 'Ticker {number}: {ticker}' where number is its index/position in the list, beginning from 0. i.e.

Ticker 0: AAPL
Ticker 1: ADBE

In [18]:
index = 0
for ticker in full_tickers:
  print(f'Ticker {index}: {ticker}')
  index += 1

Ticker 0: AAPL
Ticker 1: ADBE
Ticker 2: IBM
Ticker 3: ORCL
Ticker 4: GOOG
Ticker 5: NFLX

What is another way to do it?

In [17]:
for index, ticker in enumerate(full_tickers):
  print(f'Ticker {index}: {ticker}')

Ticker 0: AAPL
Ticker 1: ADBE
Ticker 2: IBM
Ticker 3: ORCL
Ticker 4: GOOG
Ticker 5: NFLX

## Bonus:
Create a list of the ticker's full names: APPLE, ADOBE, IBM, ORACLE, GOOGLE, NETFLIX

Print the short form of the ticker, followed by the full name (i.e. APPL: APPLE)

In [21]:
full_names = ['APPLE', 'ADOBE', 'IBM', 'ORACLE', 'GOOGLE', 'NETFLIX']

for name, ticker in zip(full_names, full_tickers):
  print(f'{ticker}: {name}')

AAPL: APPLE
ADBE: ADOBE
IBM: IBM
ORCL: ORACLE
GOOG: GOOGLE
NFLX: NETFLIX

What is a range?

In [41]:
for i in range(5):
  print(i)

0
1
2
3
4

## Dataframe Joins

Create two dataframes by running the below

In [0]:
import pandas as pd
import numpy as np

df_id = pd.DataFrame([['0123', 1000],
             ['0456', 2000],
             ['0789', 3000],
             ['1234', 4000]], columns=['id', 'value'])


df_names = pd.DataFrame([['0123', 'abc inc'],
             ['0456', 'def inc'],
             ['1234', 'abc inc']], columns=['id', 'name'])

Do an inner join on the id column

In [32]:
pd.merge(df_id, df_names, on='id')

     id  value     name
0  0123   1000  abc inc
1  0456   2000  def inc
2  1234   4000  abc inc

Do a left join on df_id

In [31]:
pd.merge(df_id, df_names, how='left', on='id')

     id  value     name
0  0123   1000  abc inc
1  0456   2000  def inc
2  0789   3000      NaN
3  1234   4000  abc inc

Run the below to create date columns in both dataframes.

Do a left join and label the suffixes with '_id' and '_name' for overlapping columns.

In [0]:
df_id['date'] = '2019-01-01'
df_names['date'] = '2019-01-01'

In [37]:
pd.merge(df_id, df_names, how='left', on='id', suffixes=('_id', '_names'))

     id  value     date_id     name  date_names
0  0123   1000  2019-01-01  abc inc  2019-01-01
1  0456   2000  2019-01-01  def inc  2019-01-01
2  0789   3000  2019-01-01      NaN         NaN
3  1234   4000  2019-01-01  abc inc  2019-01-01

Rename the id column in df_names to id_name.

Do a left join using id from df_id, and id_name from df_names.

In [0]:
df_names.rename(columns={'id':'id_name'}, inplace=True)

In [40]:
pd.merge(df_id, df_names, how='left', left_on='id', right_on='id_name')

     id  value      date_x id_name     name      date_y
0  0123   1000  2019-01-01    0123  abc inc  2019-01-01
1  0456   2000  2019-01-01    0456  def inc  2019-01-01
2  0789   3000  2019-01-01     NaN      NaN         NaN
3  1234   4000  2019-01-01    1234  abc inc  2019-01-01